app/views/account/posts/index.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
        <td><%= post.content %></td>
        <td><%= post.group.title %></td>