app/views/account/groups/index.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."group_id" = ?  [["group_id", 5]]
---
        <td><%= render_group_description(group)%></td>
        <td><%= group.posts.count %></td>