app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."group_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["group_id", 5], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."group_id" = ?  [["group_id", 5]]
---
  def show
    @group = Group.find(params[:id])
    @posts = @group.posts.recent.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "groups" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "选择"], ["description", "提升自己选择的能力，找到人生第二份工作。\r\n"], ["created_at", "2017-08-15 03:50:51.976279"], ["updated_at", "2017-08-15 03:50:51.976279"], ["user_id", 1]]
---
  def create
    @group = Group.new(group_params)
    @group.user = current_user
    if @group.save

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 2]]
---
  def destroy

    @group.destroy

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def join
    @group = Group.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def quit
    @group = Group.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_group_and_check_permission
    @group = Group.find(params[:id])