app/controllers/posts_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @group = Group.find(params[:group_id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "达到不假思索的水平。\r\n"], ["group_id", 5], ["user_id", 1], ["created_at", "2017-08-15 05:44:33.098914"], ["updated_at", "2017-08-15 05:44:33.098914"]]
---
  def create
    @group = Group.find(params[:group_id])
    @post = Post.new(post_params)
    @post.group = @group
    @post.user = current_user


    if @post.save